package 이차원배열;

import javax.swing.JFrame;
import javax.swing.JScrollPane;
import javax.swing.JTable;

public class 배열을활용테이블만들어보자 {

	public static void main(String[] args) {
		JFrame f = new JFrame();
		f.setSize(300,300);
		
		Object[] title = {"이름","나이","전공"};
		Object[][] content = {
				{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},
				{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},	{"홍길동", 100, "수학"},
				{"박길동", 200, "영어"},
				{"송길동", 100, "컴퓨터"}
		};
		
		JTable table = new JTable(content, title);
		JScrollPane scroll = new JScrollPane(table);
		f.add(scroll);	
		
		f.setVisible(true);
	}

}
